using Newtonsoft.Json.Linq;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using TableDump;

namespace ConsoleApp
{
    class Program
    {
        static void Main(string[] args)
        {
            ITableDumpPlugin tableDump = new TableDumpPlugin();

            string json = @"[
[
'整租·梅陇十村 1室1厅 南\n\n徐汇-华东理工-梅陇十村 / 50㎡ /南 / 1室1厅1卫\n\n新上 随时看房\n\n贝壳优选 4天前维护\n\n3500 元/月'
],
[
'整租·梅陇十村 1室1厅 南\n\n徐汇-华东理工-梅陇十村 / 50㎡ /南 / 1室1厅1卫\n\n新上 随时看房\n\n贝壳优选 4天前维护\n\n3500 元/月'
],
[
'整租·花苑茶花园 1室1厅 南\n\n徐汇-康健-花苑茶花园 / 34㎡ /南 / 1室1厅1卫\n\n随时看房\n\n贝壳优选 8天前维护\n\n3500 元/月'
],
[
'整租·花苑茶花园 1室1厅 南\n\n徐汇-康健-花苑茶花园 / 34㎡ /南 / 1室1厅1卫\n\n随时看房\n\n贝壳优选 8天前维护\n\n3500 元/月'
],
[
'整租·万乐城(商业类) 1室0厅 北\n\n闵行-吴泾-万乐城(商业类) / 22㎡ /北 / 1室0厅1卫\n\n精装 随时看房\n\n贝壳优选 8天前维护\n\n2000 元/月'
],
[
'整租·万乐城(商业类) 1室0厅 北\n\n闵行-吴泾-万乐城(商业类) / 22㎡ /北 / 1室0厅1卫\n\n精装 随时看房\n\n贝壳优选 8天前维护\n\n2000 元/月'
],
[
'整租·虹仙小区 1室1厅 南\n\n长宁-仙霞-虹仙小区 / 37㎡ /南 / 1室1厅1卫\n\n近地铁 精装 随时看房\n\n贝壳优选 今天维护\n\n4500 元/月'
],
[
'整租·虹仙小区 1室1厅 南\n\n长宁-仙霞-虹仙小区 / 37㎡ /南 / 1室1厅1卫\n\n近地铁 精装 随时看房\n\n贝壳优选 今天维护\n\n4500 元/月'
],
[
'整租·瞿溪路115-131号 1室0厅 北\n\n黄浦-蓬莱公园-瞿溪路115-131号 / 30㎡ /北 / 1室0厅1卫\n\n近地铁 随时看房\n\n贝壳优选 1个月前维护\n\n3900 元/月'
],
[
'整租·瞿溪路115-131号 1室0厅 北\n\n黄浦-蓬莱公园-瞿溪路115-131号 / 30㎡ /北 / 1室0厅1卫\n\n近地铁 随时看房\n\n贝壳优选 1个月前维护\n\n3900 元/月'
],
[
'整租·田林十一村 1室0厅 南\n\n徐汇-田林-田林十一村 / 35㎡ /南 / 1室0厅1卫\n\n新上 近地铁 随时看房\n\n贝壳优选 今天维护\n\n4400 元/月'
],
[
'整租·田林十一村 1室0厅 南\n\n徐汇-田林-田林十一村 / 35㎡ /南 / 1室0厅1卫\n\n新上 近地铁 随时看房\n\n贝壳优选 今天维护\n\n4400 元/月'
],
[
'整租·五浦汇B区崧子苑 2室2厅 南\n\n青浦-盈浦-五浦汇B区崧子苑 / 86㎡ /南 / 2室2厅1卫\n\n随时看房\n\n贝壳优选 3天前维护\n\n3200 元/月'
],
[
'整租·五浦汇B区崧子苑 2室2厅 南\n\n青浦-盈浦-五浦汇B区崧子苑 / 86㎡ /南 / 2室2厅1卫\n\n随时看房\n\n贝壳优选 3天前维护\n\n3200 元/月'
],
[
'整租·长虹坊 2室1厅 南\n\n徐汇-康健-长虹坊 / 74㎡ /南 / 2室1厅1卫\n\n随时看房\n\n贝壳优选 2天前维护\n\n5300 元/月'
],
[
'整租·长虹坊 2室1厅 南\n\n徐汇-康健-长虹坊 / 74㎡ /南 / 2室1厅1卫\n\n随时看房\n\n贝壳优选 2天前维护\n\n5300 元/月'
],
[
'整租·独立时代 1室0厅 南\n\n黄浦-蓬莱公园-独立时代 / 36㎡ /南 / 1室0厅1卫\n\n近地铁 精装 随时看房\n\n贝壳优选 9天前维护\n\n5190 元/月'
],
[
'整租·独立时代 1室0厅 南\n\n黄浦-蓬莱公园-独立时代 / 36㎡ /南 / 1室0厅1卫\n\n近地铁 精装 随时看房\n\n贝壳优选 9天前维护\n\n5190 元/月'
],
[
'整租·新泾一村 2室0厅 南\n\n长宁-北新泾-新泾一村 / 53㎡ /南 / 2室0厅1卫\n\n近地铁 随时看房\n\n贝壳优选 5天前维护\n\n5400 元/月'
],
[
'整租·新泾一村 2室0厅 南\n\n长宁-北新泾-新泾一村 / 53㎡ /南 / 2室0厅1卫\n\n近地铁 随时看房\n\n贝壳优选 5天前维护\n\n5400 元/月'
],
[
'整租·南丹小区 1室0厅 南\n\n徐汇-徐家汇-南丹小区 / 28㎡ /南 / 1室0厅1卫\n\n近地铁 精装 随时看房\n\n贝壳优选 今天维护\n\n4680 元/月'
],
[
'整租·南丹小区 1室0厅 南\n\n徐汇-徐家汇-南丹小区 / 28㎡ /南 / 1室0厅1卫\n\n近地铁 精装 随时看房\n\n贝壳优选 今天维护\n\n4680 元/月'
],
[
'整租·城东新村（三区） 2室1厅 南\n\n青浦-夏阳-城东新村（三区） / 64㎡ /南 / 2室1厅1卫\n\n新上 随时看房\n\n贝壳优选 5天前维护\n\n2500 元/月'
],
[
'整租·城东新村（三区） 2室1厅 南\n\n青浦-夏阳-城东新村（三区） / 64㎡ /南 / 2室1厅1卫\n\n新上 随时看房\n\n贝壳优选 5天前维护\n\n2500 元/月'
],
[
'整租·西部花苑（一期、三期） 3室2厅 南\n\n青浦-盈浦-西部花苑（一期、三期） / 119㎡ /南 / 3室2厅2卫\n\n精装 双卫生间 随时看房\n\n贝壳优选 5天前维护\n\n3500 元/月'
],
[
'整租·西部花苑（一期、三期） 3室2厅 南\n\n青浦-盈浦-西部花苑（一期、三期） / 119㎡ /南 / 3室2厅2卫\n\n精装 双卫生间 随时看房\n\n贝壳优选 5天前维护\n\n3500 元/月'
],
[
'整租·斜土路2200弄 1室1厅 南\n\n徐汇-徐家汇-斜土路2200弄 / 33㎡ /南 / 1室1厅1卫\n\n新上 近地铁 精装 随时看房\n\n贝壳优选 4天前维护\n\n5600 元/月'
],
[
'整租·斜土路2200弄 1室1厅 南\n\n徐汇-徐家汇-斜土路2200弄 / 33㎡ /南 / 1室1厅1卫\n\n新上 近地铁 精装 随时看房\n\n贝壳优选 4天前维护\n\n5600 元/月'
],
[
'整租·万寿新村(青浦) 3室2厅 南\n\n青浦-盈浦-万寿新村(青浦) / 89㎡ /南 / 3室2厅1卫\n\n精装 随时看房\n\n贝壳优选 7天前维护\n\n3600 元/月'
],
[
'整租·万寿新村(青浦) 3室2厅 南\n\n青浦-盈浦-万寿新村(青浦) / 89㎡ /南 / 3室2厅1卫\n\n精装 随时看房\n\n贝壳优选 7天前维护\n\n3600 元/月'
],
[
'整租·田林新苑 2室1厅 西\n\n徐汇-田林-田林新苑 / 70㎡ /西 / 2室1厅1卫\n\n新上 近地铁 随时看房\n\n贝壳优选 1天前维护\n\n6700 元/月'
],
[
'整租·田林新苑 2室1厅 西\n\n徐汇-田林-田林新苑 / 70㎡ /西 / 2室1厅1卫\n\n新上 近地铁 随时看房\n\n贝壳优选 1天前维护\n\n6700 元/月'
],
[
'整租·寿益坊 2室1厅 南\n\n徐汇-康健-寿益坊 / 62㎡ /南 / 2室1厅1卫\n\n随时看房\n\n贝壳优选 10天前维护\n\n5400 元/月'
],
[
'整租·寿益坊 2室1厅 南\n\n徐汇-康健-寿益坊 / 62㎡ /南 / 2室1厅1卫\n\n随时看房\n\n贝壳优选 10天前维护\n\n5400 元/月'
],
[
'整租·长桥八村 2室1厅 南\n\n徐汇-长桥-长桥八村 / 73㎡ /南 / 2室1厅1卫\n\n随时看房\n\n贝壳优选 15天前维护\n\n4800 元/月'
],
[
'整租·长桥八村 2室1厅 南\n\n徐汇-长桥-长桥八村 / 73㎡ /南 / 2室1厅1卫\n\n随时看房\n\n贝壳优选 15天前维护\n\n4800 元/月'
],
[
'整租·五浦汇A区新塘苑 2室1厅 南\n\n青浦-盈浦-五浦汇A区新塘苑 / 76㎡ /南 / 2室1厅1卫\n\n随时看房\n\n贝壳优选 3天前维护\n\n2900 元/月'
],
[
'整租·五浦汇A区新塘苑 2室1厅 南\n\n青浦-盈浦-五浦汇A区新塘苑 / 76㎡ /南 / 2室1厅1卫\n\n随时看房\n\n贝壳优选 3天前维护\n\n2900 元/月'
],
[
'整租·长桥三村 2室1厅 南\n\n徐汇-长桥-长桥三村 / 58㎡ /南 / 2室1厅1卫\n\n随时看房\n\n贝壳优选 11天前维护\n\n4400 元/月'
],
[
'整租·长桥三村 2室1厅 南\n\n徐汇-长桥-长桥三村 / 58㎡ /南 / 2室1厅1卫\n\n随时看房\n\n贝壳优选 11天前维护\n\n4400 元/月'
],
[
'整租·帕缇欧香苑 2室2厅 南\n\n青浦-夏阳-帕缇欧香苑 / 79㎡ /南 / 2室2厅1卫\n\n随时看房\n\n贝壳优选 5天前维护\n\n3100 元/月'
],
[
'整租·帕缇欧香苑 2室2厅 南\n\n青浦-夏阳-帕缇欧香苑 / 79㎡ /南 / 2室2厅1卫\n\n随时看房\n\n贝壳优选 5天前维护\n\n3100 元/月'
],
[
'整租·绿园四村 2室2厅 南\n\n长宁-西郊-绿园四村 / 89㎡ /南 / 2室2厅1卫\n\n随时看房\n\n贝壳优选 5天前维护\n\n6300 元/月'
],
[
'整租·绿园四村 2室2厅 南\n\n长宁-西郊-绿园四村 / 89㎡ /南 / 2室2厅1卫\n\n随时看房\n\n贝壳优选 5天前维护\n\n6300 元/月'
],
[
'整租·罗秀二村 2室1厅 南\n\n徐汇-长桥-罗秀二村 / 57㎡ /南 / 2室1厅1卫\n\n随时看房\n\n贝壳优选 1天前维护\n\n4300 元/月'
],
[
'整租·罗秀二村 2室1厅 南\n\n徐汇-长桥-罗秀二村 / 57㎡ /南 / 2室1厅1卫\n\n随时看房\n\n贝壳优选 1天前维护\n\n4300 元/月'
],
[
'整租·仁恒运杰河滨花园 3室1厅 南\n\n青浦-夏阳-仁恒运杰河滨花园 / 86㎡ /南 / 3室1厅1卫\n\n新上 精装 随时看房\n\n贝壳优选 今天维护\n\n3300 元/月'
],
[
'整租·仁恒运杰河滨花园 3室1厅 南\n\n青浦-夏阳-仁恒运杰河滨花园 / 86㎡ /南 / 3室1厅1卫\n\n新上 精装 随时看房\n\n贝壳优选 今天维护\n\n3300 元/月'
],
[
'整租·中心铂庭 1室1厅 西北\n\n静安-西藏北路-中心铂庭 / 50㎡ /西北 / 1室1厅1卫\n\n新上 近地铁 精装 随时看房\n\n贝壳优选 3天前维护\n\n5500 元/月'
],
[
'整租·中心铂庭 1室1厅 西北\n\n静安-西藏北路-中心铂庭 / 50㎡ /西北 / 1室1厅1卫\n\n新上 近地铁 精装 随时看房\n\n贝壳优选 3天前维护\n\n5500 元/月'
],
[
'整租·东湾小区 2室1厅 南/北\n\n徐汇-华泾-东湾小区 / 82㎡ /南 北 / 2室1厅1卫\n\n随时看房\n\n贝壳优选 16天前维护\n\n4300 元/月'
],
[
'整租·东湾小区 2室1厅 南/北\n\n徐汇-华泾-东湾小区 / 82㎡ /南 北 / 2室1厅1卫\n\n随时看房\n\n贝壳优选 16天前维护\n\n4300 元/月'
],
[
'整租·中心铂庭 1室0厅 南\n\n静安-西藏北路-中心铂庭 / 42㎡ /南 / 1室0厅1卫\n\n新上 近地铁 精装 随时看房\n\n贝壳优选 2天前维护\n\n5500 元/月'
],
[
'整租·中心铂庭 1室0厅 南\n\n静安-西藏北路-中心铂庭 / 42㎡ /南 / 1室0厅1卫\n\n新上 近地铁 精装 随时看房\n\n贝壳优选 2天前维护\n\n5500 元/月'
],
[
'整租·茶陵路65弄 1室0厅 南\n\n徐汇-斜土路-茶陵路65弄 / 29㎡ /南 / 1室0厅1卫\n\n近地铁 精装 随时看房\n\n贝壳优选 9天前维护\n\n4850 元/月'
],
[
'整租·茶陵路65弄 1室0厅 南\n\n徐汇-斜土路-茶陵路65弄 / 29㎡ /南 / 1室0厅1卫\n\n近地铁 精装 随时看房\n\n贝壳优选 9天前维护\n\n4850 元/月'
],
[
'整租·红旗花苑 2室2厅 南\n\n闵行-老闵行-红旗花苑 / 75㎡ /南 / 2室2厅1卫\n\n新上 近地铁 精装 随时看房\n\n贝壳优选 1天前维护\n\n3300 元/月'
],
[
'整租·红旗花苑 2室2厅 南\n\n闵行-老闵行-红旗花苑 / 75㎡ /南 / 2室2厅1卫\n\n新上 近地铁 精装 随时看房\n\n贝壳优选 1天前维护\n\n3300 元/月'
],
[
'整租·柳营路1025弄 2室1厅 南\n\n静安-大宁-柳营路1025弄 / 54㎡ /南 / 2室1厅1卫\n\n精装 随时看房\n\n贝壳优选 8天前维护\n\n5490 元/月'
],
[
'整租·柳营路1025弄 2室1厅 南\n\n静安-大宁-柳营路1025弄 / 54㎡ /南 / 2室1厅1卫\n\n精装 随时看房\n\n贝壳优选 8天前维护\n\n5490 元/月'
]
]";
            JArray data = JArray.Parse(json);

            tableDump.Dump(data);

        }
    }
}
